Repository: 84000/data-translation-memory
Catalog: toh1091-v3.tmx
Source language: bo
Languages: en

source: ༄༅། །ལྷ་མོ་ནམ་གྲུ་ལ་བསྟོད་པ།
en: In Praise of the Goddess Revatī

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels.

source: འཕགས་པ་དཔལ་ཕྱག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ལོ། ། ལྷ་མོ་ཆེན་མོ་རེ་མ་ཏི་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to noble, glorious Vajrapāṇi. Homage to the great goddess Rematī.

source: ནམ་གྲུ་དག་གི་ཆོ་འབྲང་དང་། །མཚན་ཉིད་དག་ནི་བཤད་བྱ་ན། །
en: The family and characteristics Of Revatī should be explained:

source: ནོར་བུའི་རང་བཞིན་ཁྱོད་ཀྱི་ལུས།
en: Your body is made of precious substances—

source: རྒྱབ་ནི་འཛམ་བུ་ཆུ་བོའི་གསེར། །ཁྱོད་ཀྱི་གདོང་ནི་དངུལ་ཡིན་ཏེ། །
en: Your back is Jambu River gold, Your front is silver,

source: ལྟོ་བའི་ངོས་ནི་རྡོ་རྗེས་བལྟམ། །མིང་པོ་མཛོད་དང་མཛོད་བདག་པོ། །ཁྱོད་ཀྱི་མ་ནི་ཀུན་འགྲོ་མ། །ཁྱོད་ཀྱི་ཕ་ནི་རླུང་ཞེས་བྱ། །
en: The surface of your belly is covered in vajra. Your brothers are Treasure and Treasure Guardian, Your mother is She Who Goes Everywhere, Your father is called Vāyu.

source: སྐལ་ལྡན་ཤིང་རྟ་ཁྱོད་ཀྱི་རུས། །ལྷ་ཡུལ་དག་ཏུ་གྲགས་པ་ཡིན། །
en: Your bloodline is that of Bhagīratha; You are renowned in the heavens.

source: ན་མོ་བཛྲ་པཱ་ཎི་སྱ། ཙི་ལི་ཙི་ལི། །བྷིནྡི་བྷིནྡི། །མུཉྩ་མུཉྩ་མུཉྩ་ཧ་བ་ལ་ཀ་ན་སྭཱ་ཧཱ། བཛྲ་བཱ་ཎི་རཱ་ཛྙཱ་པ་ཡ་ཏི་སྭཱ་ཧཱ། །དེ་བ་ས་མཱ་ཛྙཱ་པ་ཡ་ཏི་སྭཱ་ཧཱ། །རྀ་ཥ་ཡཿས་མཱཛྙཱ་པ་ཡ་ཏི་སྭཱ་ཧཱ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། །ཏབྱཐཱ། །རུ་རུ་བི་ཥིཥྠ་བདྷོཏྶི་སྭཱ་ཧཱ། །
en: namo vajrapāṇisya cili cili bhindi bhindi muñca muñca muñca havalakana svāhā| vajrapāṇīr ajñāpayati svāhā| deva samājñāpayati svāhā| rīṣayaḥ samājñāpayati svāhā|namo ratna trayāya| tadyathā| ruru viṣiṣṭhava dhotsi svāhā||

source: འདོད་པ་ཁམས་ཀྱི་དབང་ཕྱུག་མ། བདུད་ཀྱི་ཡུམ་ཆེན་མོ། །​ལྷ་མོ་ཆེན་མོ་རེ་མ་ཏིའི་གཟུངས་རྫོགས་སྷོ།​། །​།
en: This completes the dhāraṇī of the great goddess Rematī, the Powerful Lady of the Desire Realm, the Great Mother of Demons.
